# 7. Data Selection (loc)
select row and then select column by using name

In [13]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col = 'number')
df

         name  school    language  gpa
number
1        Park  GATech      Python  3.4
2         Lee  GATech        Java  3.2
3         Kim  GATech           C  3.8
4       Rishi  GATech        Ruby  4.0
5        Chen  GATech  TypeScript  3.5

In [14]:
df.loc[4]

name         Rishi
school      GATech
language      Ruby
gpa              4
Name: 4, dtype: object

In [15]:
df.loc[4, 'language']

'Ruby'

In [16]:
df.loc[[1,5], 'school']

number
1    GATech
5    GATech
Name: school, dtype: object

In [17]:
df.loc[[1,5], ['name', 'language']]

        name    language
number
1       Park      Python
5       Chen  TypeScript

In [18]:
df.loc[1:4, 'school':'language'] # 1 to 4 data

        school language
number
1       GATech   Python
2       GATech     Java
3       GATech        C
4       GATech     Ruby